# 数字列表的一些操作
import random
numbers = [1, 29, 34, 56, 32, 46, 32, 45, 293, 0, 34]
print(max(numbers))
print(min(numbers))
print(sum(numbers))

# 列表精简
squares = [value**2 for value in range(1, 11)]
print(squares)

# 生成一个长列表
# num_list = [random.randint(1,100000) for x in range(100000)]
# print(num_list)
# 生成一个不重复的长列表
# num_list = random.sample([i for i in range(1000000)], 1000)
# print(num_list)

num_list = [90749, 625987, 972615, 829757, 291464, 191909, 569860, 870506, 230796, 352611, 904645, 101040, 251564, 886992, 
            664959, 261056, 154019, 668800, 375307, 475242, 878286, 360419, 13691, 841475, 855409, 420198, 373692, 456133, 548966, 
            481004, 626536, 538189, 193135, 394404, 295747, 942735, 526449, 770282, 87272, 826675, 332797, 654954, 138606, 55411, 
            457780, 597590, 976962, 89422, 611731, 668618, 631667, 676739, 575218, 614338, 829898, 890970, 528202, 50218, 823069]

print(max(num_list))
print(min(num_list))