# Python列表的切片
friends = ["俸诚希", "唐瀚宇", "吴泓怿", "贾汶瀚", "常博康", "李子见", "马凌霄", "刘奕辰"]
print(friends[1:3]) # 提取列表中的第2到3个元素

# 再试一次
friends = ["俸诚希", "唐瀚宇", "吴泓怿", "贾汶瀚", "常博康", "李子见", "马凌霄", "刘奕辰"]
print(friends[0:4]) # 提取列表中的第1到4个元素

# 不指定索引起始位置
friends = ["俸诚希", "唐瀚宇", "吴泓怿", "贾汶瀚", "常博康", "李子见", "马凌霄", "刘奕辰"]
print(friends[:4]) # 提取列表中的第1到4个元素

# 不指定索引结束位置
friends = ["俸诚希", "唐瀚宇", "吴泓怿", "贾汶瀚", "常博康", "李子见", "马凌霄", "刘奕辰"]
print(friends[2:]) # 提取列表中的第3到最后一个元素

# 索引倒数三个元素
friends = ["俸诚希", "唐瀚宇", "吴泓怿", "贾汶瀚", "常博康", "李子见", "马凌霄", "刘奕辰"]
print(friends[-3:]) # 提取列表中的倒数第3个元素到最后1个元素

